const friends = [
    {
    id:"yuji",

    name:"YUJI",

    color:"#ffd82b",

    avatar:"assets/avatar/yuji.jpg",

    message:"Для солнышка 🤍",

    songs:[

	{
        title:"Kwik Flip",
        artist:"YTPMV",
        file:"assets/music/kwik_flip.mp3"
    },
    {
        title:"Шелкопряд ",
        artist:"Flëur",
        file:"assets/music/yuji.mp3"
    },
    {
        title:"Free Bird",
        artist:"MOONLGHT",
        file:"assets/music/Moonlght.mp3"
    },
	{
        title:"FUNK DE BELEZA",
        artist:"Feat. Nateki",
        file:"assets/music/funk_de_beleza.mp3"
    }
    ],

    memories: [
        {
            photo: "assets/images/1.jpg",
            text: "Я до сих пор помню этот день.",
			date:"18.02.2026",
			author:"YUJI",
        },
        {
            photo: "assets/images/2.jpg",
            text: "Спасибо за все разговоры.",
			date:"02.06.2026",
			author:"YUJI",
        },
        {
            photo: "assets/images/3.jpg",
            text: "Иногда самые обычные моменты становятся самыми важными.",
			date:"28.04.2026",
			author:"YUJI",
        },
        {
            photo: "assets/images/4.jpg",
            text: "Я рада, что мы встретились.",
			date:"13.02.2026",
			author:"YUJI",
        },
        {
            photo: "assets/images/5.jpg",
            text: "Это только начало нашей истории.",
			date:"23.06.2026",
			author:"YUJI",
        }
    ],

	ending:  

		`Спасибо, что стал частью моей жизни.

		Некоторые люди остаются просто знакомыми.

		Некоторые становятся воспоминаниями.

		А некоторые становятся частью тебя.

		Спасибо. ❤️`
	,
	letter: 
	`Полгода — вроде бы не такой большой срок. Но иногда человеку достаточно совсем немного времени, чтобы стать по-настоящему важным. Я до сих пор очень рада, что однажды решилась написать тебе в личные сообщения и предложить дружбу. Честно, это было одним из лучших решений, которые я могла принять.

    За эти полгода ты стал(а) для меня одним из самых светлых и ярких людей, которых я встречала. Ты очень добрый, понимающий и искренний человек. С тобой спокойно быть собой, не бояться показаться странной, делиться мыслями, радостями и переживаниями. Это невероятно ценно.

    Спасибо тебе за все разговоры, поддержку, смех и просто за то, что ты есть в моей жизни. Даже в самые обычные дни ты делаешь их немного теплее. Я ни разу не пожалела, что тогда написала тебе. Наоборот — очень благодарна судьбе за то, что наши пути пересеклись.

    Надеюсь, впереди нас ждёт ещё очень много моментов, воспоминаний и поводов улыбаться. Спасибо тебе за нашу дружбу. Береги себя, пожалуйста. Ты действительно замечательный человек, и я очень рада, что могу назвать тебя своим другом. 🤍 `,

	},

	{
    id:"LYUBEN",

    name:"LYUBEN",

    color:"#c95564",

    avatar:"assets/avatar/Lyuben.jpg",

    message:"Для звездочки ✨",

    songs:[
        {
        title:"Sagynysh",
        artist:"sadraddin",
        file:"assets/music/lyuben1.m4a"
    },

        {
        title:"Yong and Beautiful",
        artist:"Lana Del Rey",
        file:"assets/music/lyuben.m4a"
    },
    {
        title:"Brooklyn Baby",
        artist:"Lana Del Rey",
        file:"assets/music/brooklyn.m4a"
    }

    ],

    memories:[
         {
            photo: "assets/images/6.jpg",
            text: "С тобой я могу быть собой, и это один из самых ценных подарков.",
			date:"27.05.2026",
			author:"LYUBEN",
        },
        {
            photo: "assets/images/7.jpg",
            text: "Иногда лучшие люди приходят в нашу жизнь совершенно случайно.",
			date:"14.05.2026",
			author:"LYUBEN",
        },
        {
            photo: "assets/images/8.jpg",
            text: "Надеюсь, впереди нас ждет еще много теплых разговоров и счастливых воспоминаний.",
			date:"16.05.2026",
			author:"LYUBEN",
        },
        {
            photo: "assets/images/9.jpg",
            text: "Я никогда не думала, что простой заход во флуд приведет к такому важному знакомству.",
			date:"28.04.2026",
			author:"LYUBEN",
        },
        {
            photo: "assets/images/10.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"LYUBEN",
        }
    ],

    ending:`Спасибо тебе за каждый разговор, за поддержку, за смех и за те моменты, когда ты просто была рядом. Иногда даже несколько сообщений могут сделать день намного лучше, и ты умеешь это делать, даже не замечая. ❤️`
    ,
    letter: 
	`Знаешь, иногда самые важные люди появляются в нашей жизни совершенно случайно. Так произошло и с тобой. Всего пару месяцев назад я просто зашла во флуд, и тогда я даже представить не могла, что встречу человека, который станет для меня настолько дорогим. Сейчас я могу с уверенностью сказать, что никогда не пожалею о том случайном поступке.

    Ты стала одним из самых приятных, теплых и любимых людей, с которыми мне довелось общаться. Мне невероятно комфортно рядом с тобой. С тобой можно говорить обо всём: о серьезных вещах, о глупостях, смеяться, обсуждать мысли, переживания и просто проводить время. И самое ценное для меня — рядом с тобой я не чувствую необходимости притворяться. Я могу быть собой, показать себя настоящую, без страха, что меня не поймут или осудят.

    Спасибо тебе за твое понимание, доброту и искренность. За то, что делаешь обычные разговоры такими уютными и важными. Ты стала человеком, которого я очень ценю, и мне невероятно повезло познакомиться с тобой. Я очень надеюсь, что это только начало нашей дружбы. Пусть впереди будет еще много разговоров до поздней ночи, смешных моментов, поддержки и теплых воспоминаний. Спасибо, что появилась в моей жизни. 🤍 `,
    
	},
    {
    id:"Yato",

    name:"YATO",

    color:"#db8641",

    avatar:"assets/avatar/YAto.jpg",

    message:"Для человека, которого я рада была встретить 😄",

    songs:[
        {
        title:"Маша",
        artist:"ПОЛМАТЕРИ",
        file:"assets/music/Masha.m4a"
    },

        {
        title:"Тачки четыре",
        artist:"ПОЛМАТЕРИ",
        file:"assets/music/tachka.m4a"
    },
    {
        title:"Псы попадут в рай",
        artist:"ПОЛМАТЕРИ",
        file:"assets/music/psi.m4a"
    }

    ],

    memories:[
         {
            photo: "assets/images/11.jpg",
            text: "Я очень ценю каждый наш разговор.",
			date:"20.06.2026",
			author:"YATO",
        },
        {
            photo: "assets/images/12.jpg",
            text: "Ты — одно из самых теплых знакомств этого года.",
			date:"06.06.2026",
			author:"YATO",
        },
        {
            photo: "assets/images/13.jpg",
            text: "Спасибо, что однажды ответила мне.",
			date:"09.06.2026",
			author:"YATO",
        },
        {
            photo: "assets/images/14.jpg",
            text: "Мой глаз выцепил алмаз, и я считаю, что не случайно заметила твой профиль перед выходом из флуда.",
			date:"04.06.2026",
			author:"YATO",
        },
        {
            photo: "assets/images/15.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"YATO",
        }
    ],

    ending:`Спасибо, что сделала эти несколько недель такими уютными. Мне очень нравятся наши разговоры, и я искренне надеюсь, что впереди нас ждет еще много счастливых моментов. ❤️`
    ,
    letter: 
	`Иногда человеку хватает совсем немного времени, чтобы стать по-настоящему важным. Кажется, мы знакомы всего пару недель, но за это время ты уже успела стать человеком, с которым мне очень приятно общаться. Мне хватило узнать тебя совсем немного, чтобы понять, какая ты чудесная, добрая и веселая. С тобой легко говорить, легко смеяться и просто проводить время. Мне очень нравится, когда мы одновременно оказываемся в сети и наш разговор начинается сам собой. Неважно, о чем мы говорим — мне ценны сами эти моменты.

    Я очень надеюсь, что это знакомство перерастет в долгую и крепкую дружбу. Мне хочется узнать тебя еще лучше, прожить вместе много теплых моментов и создать воспоминания, которые будут греть еще долго.

    Спасибо, что появилась в моей жизни. Пусть прошло совсем немного времени, но я уже очень рада, что однажды мы встретились. Надеюсь, впереди нас ждет еще очень много разговоров, смеха и счастливых дней. 🤍 `,
	},

    {
    id:"Hashiramix",

    name:"HASHIRAMIX",

    color:"#643d10",

    avatar:"assets/avatar/Hashiramix.jpg",

    message:"Для Дурика 🦊",

    songs:[
        {
        title:"Дух болот",
        artist:"Вольный путь",
        file:"assets/music/Duh.mp3"
    },

        {
        title:"Пугало",
        artist:"Вольный путь",
        file:"assets/music/pugalo.mp3"
    },
    // {
    //     title:"Псы попадут в рай",
    //     artist:"Вольный путь",
    //     file:"assets/music/psi.mp3"
    // }

    ],

    memories:[
         {
            photo: "assets/images/16.jpg",
            text: "Ты стал одним из тех людей, которых мне хочется беречь.",
			date:"29.10.2025",
			author:"HASHIRAMIX",
        },
        {
            photo: "assets/images/17.jpg",
            text: "Я очень ценю нашу дружбу и ни на секунду не жалею, что мы познакомились.",
			date:"26.10.2025",
			author:"HASHIRAMIX",
        },
        {
            photo: "assets/images/18.jpg",
            text: "Спасибо за все часы, проведенные в разговорах с тобой.",
			date:"02.11.2025",
			author:"HASHIRAMIX",
        },
        {
            photo: "assets/images/19.jpg",
            text: "Для меня ты — не «старше» или «младше», а просто очень дорогой человек.",
			date:"20.12.2025",
			author:"HASHIRAMIX",
        },
        {
            photo: "assets/images/20.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"HASHIRAMIX",
        }
    ],

    ending:`Спасибо за то, что почти год остаешься частью моей жизни. Наша дружба научила меня тому, что расстояние между сообщениями ничего не значит, если люди действительно ценят друг друга. Спасибо за каждый разговор и за то, что ты есть. ❤️`
    ,
    letter: 
	`Почти год назад я совершенно случайно решила зайти во флуд за Мадару. Тогда я даже не представляла, что это приведет меня к знакомству с таким замечательным человеком.

    За это время ты стал для меня не просто хорошим знакомым, а дорогим другом. И знаешь, мне очень нравится одна особенность нашей дружбы: неважно, говорим мы каждый день или проходит какое-то время. Когда мы снова начинаем общаться, ощущение такое, будто никакой паузы и не было. Наша связь никуда не исчезает, и это очень ценно для меня.

    Спасибо тебе за твою открытость, доброту и искренность. За разговоры, поддержку, шутки и просто за то, что ты есть. Мне очень повезло встретить тебя, и я ни разу не пожалела о том случайном решении зайти в тот флуд. Я очень ценю нашу дружбу и надеюсь, что впереди нас ждет еще много разговоров, смеха и теплых воспоминаний. Спасибо, что стал частью моей жизни. 🤍 `,
    
	},

    {
    id:"Yuxinger",

    name:"YUXINGER",

    color:"#967f7f",

    avatar:"assets/avatar/Yuxinger.jpg",

    message:"Для человека, который сделал эти месяцы лучше ☄️",

    songs:[
        {
        title:"위인전 Hall of Fame",
        artist:"Stray Kids",
        file:"assets/music/Ami1.m4a"
    },

        {
        title:"스트레이 키즈 @2차 경연 ",
        artist:" [Full Cam] ♬ 기도 (I'll Be Your Man) (Stray Kids Ver.)",
        file:"assets/music/Ami2.m4a"
    },
    {
        title:"Like Magic",
        artist:".Y. Park, Stray Kids, ITZY, NMIXX ",
        file:"assets/music/Ami3.m4a"
    }

    ],

    memories:[
         {
            photo: "assets/images/26.jpg",
            text: "Спасибо за все годы нашей дружбы.",
			date:"22.10.2024 ",
			author:"YUXINGER",
        },
        {
            photo: "assets/images/27.jpg",
            text: "Мы вместе пережили многое",
			date:"02.02.2025",
			author:"YUXINGER",
        },  
        {
            photo: "assets/images/28.jpg",
            text: "Я рада, что однажды мы познакомились.",
			date:"02.11.2024",
			author:"YUXINGER",
        },
        {
            photo: "assets/images/29.jpg",
            text: "Надеюсь, впереди нас ждет еще много счастливых моментов.",
			date:"02.12.2024",
			author:"YUXINGER",
        },
        {
            photo: "assets/images/30.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"YUXINGER",
        }
    ],

    ending:`Спасибо тебе за дружбу. Мы многое пережили вместе, и я рада, что все это время ты была рядом.  Я очень ценю нашу дружбу и надеюсь, что впереди нас ждет еще больше хороших воспоминаний. ❤️`
    ,
    letter: 
	`Кажется, мы знакомы уже два года. Если честно, я даже не помню, в какой момент началась наша дружба — настолько естественной она стала для меня. Такое чувство, будто ты была рядом уже очень давно. Для меня ты всегда была и останешься тем самым светлым лучиком, который делает этот мир чуточку добрее. Ты — человек, который заслуживает всего самого хорошего.

    Мне очень нравится, как легко с тобой общаться. Неважно, о чем идет разговор — рядом с тобой всегда спокойно и уютно. И я знаю, что если вдруг понадобится помощь или поддержка, ты никогда не останешься в стороне. Это качество я в тебе очень ценю. Пусть сейчас у тебя уже другой ник, для меня ты навсегда останешься Ами. Именно такой я тебя запомнила, именно под этим именем хранится столько теплых воспоминаний. И, наверное, так будет всегда.

    Спасибо тебе за эти почти два года дружбы, за смех, за разговоры, за поддержку и за все моменты, которые мы разделили. Я очень надеюсь, что впереди нас ждет еще много счастливых воспоминаний, ведь мне совсем не хочется, чтобы наша история когда-нибудь закончилась.

    Береги себя, хорошо? Спасибо, что ты есть. 🤍`,
	},
    {
    id:"RIN",

    name:"RIN",

    color:"#700b07",

    avatar:"assets/avatar/Rin.jpg",

    message:"Для моего брата ☕",

    songs:[
        {
        title:"RICHMAN",
        artist:"ЗOH!3",
        file:"assets/music/rin2.m4a"
    },

        {
        title:"A Little Death",
        artist:"Thr Nieghbourhood",
        file:"assets/music/rin1.mp3"
    },
    {
        title:"Ангел",
        artist:"Юпи, FORTUNA 812",
        file:"assets/music/rin3.mp3"
    },
    {
        title:"2.0",
        artist:"BTS",
        file:"assets/music/rin4.mp4a"
    },

    ],

    memories:[
         {
            photo: "assets/images/31.jpg",
            text: "Спасибо за все безумные моменты.",
			date:"15.08.2023",
			author:"RIN",
        },
        {
            photo: "assets/images/32.jpg",
            text: "Наша дружба началась с простой случайности.",
			date:"14.04.2023",
			author:"RIN",
        },
        {
            photo: "assets/images/33.jpg",
            text: "Случайный флуд подарил мне настоящего брата.",
			date:"18.05.2024",
			author:"RIN",
        },
        {
            photo: "assets/images/34.jpg",
            text: "Спасибо, что все это время была рядом.",
			date:"22.12.2025",
			author:"RIN",
        },
        {
            photo: "assets/images/35.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"RIN ",
        }
    ],

    ending:`Спасибо за все, что мы пережили вместе. За каждый смешной момент, каждую трудность и каждое воспоминание, которое теперь связано с тобой. Мы вместе пережили многое, и я искренне рада, что все это время мы шли бок о бок. Я очень рада, что однажды решила зайти в тот флуд. ❤️`
    ,
    letter: 
	`Три года… Если честно, я сама удивляюсь тому, как быстро пролетело это время. Кажется, совсем недавно мы познакомились совершенно случайно во флуде. Тогда я ни на что не рассчитывала и уж точно не могла представить, что обычное знакомство на фоне шутливого «флирта» перерастет в дружбу длиной в три года. За это время произошло столько всего, что и не сосчитать. Мы вместе пережили тяжелые моменты и радовались хорошим, встретили множество людей и проводили не меньше. Но, несмотря ни на что, продолжали идти рядом.

    Наверное, именно поэтому эти три года стали одними из самых безбашенных, ярких и незабываемых в моей жизни. В них было столько смеха, странных историй, бессонных разговоров и воспоминаний, что иногда даже трудно поверить, сколько всего мы успели пережить.

    Спасибо тебе за то, что все это время была рядом. За поддержку, за понимание, за моменты, когда мы просто смеялись без причины, и за то, что с тобой всегда можно оставаться собой.

    Я очень ценю нашу дружбу. Надеюсь, что впереди нас ждет еще много лет, новых историй, безумных идей и воспоминаний, над которыми мы однажды будем смеяться так же, как смеемся сейчас.

    Спасибо, что одна случайность подарила мне такого друга. 🤍 `,
	},
    
    {
    id:"TOKITO",

    name:"TOKITO",

    color:"#3e8142",

    avatar:"assets/avatar/Tokito.jpg",

    message:"Для того, с кем хочется говорить 🌙",

    songs:[
        
        {
        title:"FLY HIGT",
        artist:"HAIKYU!! opening 4",
        file:"assets/music/virsa4.mp3"
    },
        {
        title:"King Gnu",
        artist:"SPECIALZ",
        file:"assets/music/virsa.mp3"
    },

        {
        title:"Where our Blue is",
        artist:"Tatsuya Kitami",
        file:"assets/music/virsa2.mp3"
    },
    {
        title:"Fuera del Planeta",
        artist:"Jowell & Randy",
        file:"assets/music/virsa3.mp3"
    }

    ],

    memories:[
         {
            photo: "assets/images/21.jpg",
            text: "Разные взгляды делают разговоры интереснее.",
			date:"22.05.2026",
			author:"TOKITO",
        },
        {
            photo: "assets/images/22.jpg",
            text: "Я рада, что однажды мы познакомились.",
			date:"18.05.2026",
			author:"TOKITO",
        },
        {
            photo: "assets/images/23.jpg",
            text: "Иногда случайные встречи становятся особенными.",
			date:"20.05.2026",
			author:"TOKITO",
        },
        {
            photo: "assets/images/24.jpg",
            text: "Каждый разговор по-своему ценен.",
			date:"17.06.2026",
			author:"TOKITO",
        },
        {
            photo: "assets/images/25.jpg",
            text: "Это только начало нашей истории.",
			date:"24.06.2026",
			author:"TOKITO",
        }
    ],

    ending:`Спасибо за все разговоры, разные взгляды и новые эмоции. Именно это делает наше общение таким интересным. Я очень рада, что однажды наши пути пересеклись, надеюсь, впереди нас ждет еще больше теплых воспоминаний. ❤️`
    ,
    letter: 
	`Всего два месяца назад мы были совершенно незнакомыми людьми, а сейчас у нас уже есть свои общие воспоминания. Наверное, именно поэтому я люблю случайные знакомства — никогда не знаешь, какое из них станет по-настоящему важным. Я очень рада, что однажды зашла в тот чат и встретила тебя. Тогда это казалось обычной случайностью, но сейчас я понимаю, что некоторые встречи действительно происходят не просто так.

    Возможно, где-то наши взгляды не совпадают, но мне кажется, что в этом есть своя прелесть. Благодаря этому наши разговоры всегда получаются интересными, а общение — живым и настоящим.

    Ты очень открытый и приятный собеседник, с которой легко говорить на самые разные темы. Я ни капли не жалею, что тогда наши пути пересеклись, и искренне надеюсь, что это только начало нашей дружбы.

    Спасибо тебе за эти два месяца, за все разговоры и хорошие моменты. Случайности действительно не случайны. 🤍 `,
    
	}

];